In [1]:
import pandas as pd
import numpy as np

In [2]:
havaDurumDataFrame= pd.DataFrame({"ıstanbul":[30,29, np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38]})

In [3]:
havaDurumDataFrame

   ıstanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
 havaDurumDataFrame.dropna()

   ıstanbul  ankara  izmir
0      30.0    20.0     40

In [5]:
havaDurumDataFrame.dropna(axis=1)

   izmir
0     40
1     39
2     38

In [7]:
yeniVeri={"ıstanbul":[30,29, np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38],"osmaniye":[40,np.nan,np.nan]}

In [8]:
yeniDf= pd.DataFrame(yeniVeri)

In [9]:
yeniDf

   ıstanbul  ankara  izmir  osmaniye
0      30.0    20.0     40      40.0
1      29.0     NaN     39       NaN
2       NaN    25.0     38       NaN

In [10]:
yeniDf.dropna(axis=1,thresh=2)

   ıstanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
yeniDf.fillna(20)

   ıstanbul  ankara  izmir  osmaniye
0      30.0    20.0     40      40.0
1      29.0    20.0     39      20.0
2      20.0    25.0     38      20.0

## groupby

In [15]:
maasSozlugu={"depertman":["yazılım","yazılım","pazarlama","pazarlama","hr","hr"],
            "calısan ismi":["ahmet","burak","esra","atil","esma","eda"],
            "maas":[100,150,200,300,400,500]}

In [16]:
maasDf=pd.DataFrame(maasSozlugu)

In [17]:
maasDf

   depertman calısan ismi  maas
0    yazılım        ahmet   100
1    yazılım        burak   150
2  pazarlama         esra   200
3  pazarlama         atil   300
4         hr         esma   400
5         hr          eda   500

In [22]:
groupObje=maasDf.groupby("depertman")

In [23]:
groupObje.count()

           calısan ismi  maas
depertman
hr                    2     2
pazarlama             2     2
yazılım               2     2

In [24]:
groupObje.mean()

            maas
depertman
hr         450.0
pazarlama  250.0
yazılım    125.0

In [25]:
groupObje.min()

          calısan ismi  maas
depertman
hr                 eda   400
pazarlama         atil   200
yazılım          ahmet   100

In [26]:
groupObje.max()

          calısan ismi  maas
depertman
hr                esma   500
pazarlama         esra   300
yazılım          burak   150

In [27]:
groupObje.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
depertman
hr          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0